### Basic concat

In [4]:
import pandas as pd

india_weather = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
    "humidity": [80, 60, 78]
})
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [5]:
import pandas as pd

USA_weather = pd.DataFrame({
    "city": ["newyork","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
})
USA_weather

      city  temperature  humidity
0  newyork           21        68
1  chicago           14        65
2  orlando           35        75

In [6]:
df=pd.concat([india_weather,USA_weather])
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
0   newyork           21        68
1   chicago           14        65
2   orlando           35        75

In [7]:
df=pd.concat([
    india_weather,USA_weather
],ignore_index=True)
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3   newyork           21        68
4   chicago           14        65
5   orlando           35        75

### Concatenation and keys

In [8]:
df=pd.concat([india_weather,USA_weather], keys=["india","USA"])
df

             city  temperature  humidity
india 0    mumbai           32        80
      1     delhi           45        60
      2  banglore           30        78
USA   0   newyork           21        68
      1   chicago           14        65
      2   orlando           35        75

### Print Indian city Data

In [9]:
df.loc['india']

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [10]:
df.loc['USA']

      city  temperature  humidity
0  newyork           21        68
1  chicago           14        65
2  orlando           35        75

### Only Temperature Data

In [11]:
temperature_df=pd.DataFrame({
    "city":["mumbai","delhi","banglore"],
    "temperature":[32,45,38],
})
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           38

### Only Wind Data

In [12]:
windspeed_df=pd.DataFrame({
    "city":["mumbai","delhi","banglore"],
    "windspeed":[7,8,6],
})
windspeed_df

       city  windspeed
0    mumbai          7
1     delhi          8
2  banglore          6

In [13]:
df=pd.concat([temperature_df,windspeed_df],axis=1)
df

       city  temperature      city  windspeed
0    mumbai           32    mumbai          7
1     delhi           45     delhi          8
2  banglore           38  banglore          6

### We want to add event column into Temperature Table

In [16]:
s=pd.Series(["snow","Rain","Dusty"], name="event")
s

0     snow
1     Rain
2    Dusty
Name: event, dtype: object

In [17]:
df=pd.concat([temperature_df,s],axis=1)
df

       city  temperature  event
0    mumbai           32   snow
1     delhi           45   Rain
2  banglore           38  Dusty